MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F217ZG/mcu.h
/* Legacy defines */
#define GPIO_OTYPER_OT_0                    GPIO_OTYPER_OT0
#define GPIO_OTYPER_OT_1                    GPIO_OTYPER_OT1
#define GPIO_OTYPER_OT_2                    GPIO_OTYPER_OT2
#define GPIO_OTYPER_OT_3                    GPIO_OTYPER_OT3
#define GPIO_OTYPER_OT_4                    GPIO_OTYPER_OT4
#define GPIO_OTYPER_OT_5                    GPIO_OTYPER_OT5
#define GPIO_OTYPER_OT_6                    GPIO_OTYPER_OT6
#define GPIO_OTYPER_OT_7                    GPIO_OTYPER_OT7
#define GPIO_OTYPER_OT_8                    GPIO_OTYPER_OT8
#define GPIO_OTYPER_OT_9                    GPIO_OTYPER_OT9
#define GPIO_OTYPER_OT_10                   GPIO_OTYPER_OT10
#define GPIO_OTYPER_OT_11                   GPIO_OTYPER_OT11
#define GPIO_OTYPER_OT_12                   GPIO_OTYPER_OT12
#define GPIO_OTYPER_OT_13                   GPIO_OTYPER_OT13
#define GPIO_OTYPER_OT_14                   GPIO_OTYPER_OT14
#define GPIO_OTYPER_OT_15                   GPIO_OTYPER_OT15

/******************  Bits definition for GPIO_OSPEEDR register  ***************/
#define GPIO_OSPEEDR_OSPEED0                0x00000003U
#define GPIO_OSPEEDR_OSPEED0_0              0x00000001U
#define GPIO_OSPEEDR_OSPEED0_1              0x00000002U
#define GPIO_OSPEEDR_OSPEED1                0x0000000CU
#define GPIO_OSPEEDR_OSPEED1_0              0x00000004U
#define GPIO_OSPEEDR_OSPEED1_1              0x00000008U
#define GPIO_OSPEEDR_OSPEED2                0x00000030U
#define GPIO_OSPEEDR_OSPEED2_0              0x00000010U
#define GPIO_OSPEEDR_OSPEED2_1              0x00000020U
#define GPIO_OSPEEDR_OSPEED3                0x000000C0U
#define GPIO_OSPEEDR_OSPEED3_0              0x00000040U
#define GPIO_OSPEEDR_OSPEED3_1              0x00000080U
#define GPIO_OSPEEDR_OSPEED4                0x00000300U
#define GPIO_OSPEEDR_OSPEED4_0              0x00000100U
#define GPIO_OSPEEDR_OSPEED4_1              0x00000200U
#define GPIO_OSPEEDR_OSPEED5                0x00000C00U
#define GPIO_OSPEEDR_OSPEED5_0              0x00000400U
#define GPIO_OSPEEDR_OSPEED5_1              0x00000800U
#define GPIO_OSPEEDR_OSPEED6                0x00003000U
#define GPIO_OSPEEDR_OSPEED6_0              0x00001000U
#define GPIO_OSPEEDR_OSPEED6_1              0x00002000U
#define GPIO_OSPEEDR_OSPEED7                0x0000C000U
#define GPIO_OSPEEDR_OSPEED7_0              0x00004000U
#define GPIO_OSPEEDR_OSPEED7_1              0x00008000U
#define GPIO_OSPEEDR_OSPEED8                0x00030000U
#define GPIO_OSPEEDR_OSPEED8_0              0x00010000U
#define GPIO_OSPEEDR_OSPEED8_1              0x00020000U
#define GPIO_OSPEEDR_OSPEED9                0x000C0000U
#define GPIO_OSPEEDR_OSPEED9_0              0x00040000U
#define GPIO_OSPEEDR_OSPEED9_1              0x00080000U
#define GPIO_OSPEEDR_OSPEED10               0x00300000U
#define GPIO_OSPEEDR_OSPEED10_0             0x00100000U
#define GPIO_OSPEEDR_OSPEED10_1             0x00200000U
#define GPIO_OSPEEDR_OSPEED11               0x00C00000U
#define GPIO_OSPEEDR_OSPEED11_0             0x00400000U
#define GPIO_OSPEEDR_OSPEED11_1             0x00800000U
#define GPIO_OSPEEDR_OSPEED12               0x03000000U
#define GPIO_OSPEEDR_OSPEED12_0             0x01000000U
#define GPIO_OSPEEDR_OSPEED12_1             0x02000000U
#define GPIO_OSPEEDR_OSPEED13               0x0C000000U
#define GPIO_OSPEEDR_OSPEED13_0             0x04000000U
#define GPIO_OSPEEDR_OSPEED13_1             0x08000000U
#define GPIO_OSPEEDR_OSPEED14               0x30000000U
#define GPIO_OSPEEDR_OSPEED14_0             0x10000000U
#define GPIO_OSPEEDR_OSPEED14_1             0x20000000U
#define GPIO_OSPEEDR_OSPEED15               0xC0000000U
#define GPIO_OSPEEDR_OSPEED15_0             0x40000000U
#define GPIO_OSPEEDR_OSPEED15_1             0x80000000U

/* Legacy defines */
#define GPIO_OSPEEDER_OSPEEDR0              GPIO_OSPEEDR_OSPEED0
#define GPIO_OSPEEDER_OSPEEDR0_0            GPIO_OSPEEDR_OSPEED0_0
#define GPIO_OSPEEDER_OSPEEDR0_1            GPIO_OSPEEDR_OSPEED0_1
#define GPIO_OSPEEDER_OSPEEDR1              GPIO_OSPEEDR_OSPEED1
#define GPIO_OSPEEDER_OSPEEDR1_0            GPIO_OSPEEDR_OSPEED1_0
#define GPIO_OSPEEDER_OSPEEDR1_1            GPIO_OSPEEDR_OSPEED1_1
#define GPIO_OSPEEDER_OSPEEDR2              GPIO_OSPEEDR_OSPEED2
#define GPIO_OSPEEDER_OSPEEDR2_0            GPIO_OSPEEDR_OSPEED2_0
#define GPIO_OSPEEDER_OSPEEDR2_1            GPIO_OSPEEDR_OSPEED2_1
#define GPIO_OSPEEDER_OSPEEDR3              GPIO_OSPEEDR_OSPEED3
#define GPIO_OSPEEDER_OSPEEDR3_0            GPIO_OSPEEDR_OSPEED3_0
#define GPIO_OSPEEDER_OSPEEDR3_1            GPIO_OSPEEDR_OSPEED3_1
#define GPIO_OSPEEDER_OSPEEDR4              GPIO_OSPEEDR_OSPEED4
#define GPIO_OSPEEDER_OSPEEDR4_0            GPIO_OSPEEDR_OSPEED4_0
#define GPIO_OSPEEDER_OSPEEDR4_1            GPIO_OSPEEDR_OSPEED4_1
#define GPIO_OSPEEDER_OSPEEDR5              GPIO_OSPEEDR_OSPEED5
#define GPIO_OSPEEDER_OSPEEDR5_0            GPIO_OSPEEDR_OSPEED5_0
#define GPIO_OSPEEDER_OSPEEDR5_1            GPIO_OSPEEDR_OSPEED5_1
#define GPIO_OSPEEDER_OSPEEDR6              GPIO_OSPEEDR_OSPEED6
#define GPIO_OSPEEDER_OSPEEDR6_0            GPIO_OSPEEDR_OSPEED6_0
#define GPIO_OSPEEDER_OSPEEDR6_1            GPIO_OSPEEDR_OSPEED6_1
#define GPIO_OSPEEDER_OSPEEDR7              GPIO_OSPEEDR_OSPEED7
#define GPIO_OSPEEDER_OSPEEDR7_0            GPIO_OSPEEDR_OSPEED7_0
#define GPIO_OSPEEDER_OSPEEDR7_1            GPIO_OSPEEDR_OSPEED7_1
#define GPIO_OSPEEDER_OSPEEDR8              GPIO_OSPEEDR_OSPEED8
#define GPIO_OSPEEDER_OSPEEDR8_0            GPIO_OSPEEDR_OSPEED8_0
#define GPIO_OSPEEDER_OSPEEDR8_1            GPIO_OSPEEDR_OSPEED8_1
#define GPIO_OSPEEDER_OSPEEDR9              GPIO_OSPEEDR_OSPEED9
#define GPIO_OSPEEDER_OSPEEDR9_0            GPIO_OSPEEDR_OSPEED9_0
#define GPIO_OSPEEDER_OSPEEDR9_1            GPIO_OSPEEDR_OSPEED9_1
#define GPIO_OSPEEDER_OSPEEDR10             GPIO_OSPEEDR_OSPEED10
#define GPIO_OSPEEDER_OSPEEDR10_0           GPIO_OSPEEDR_OSPEED10_0
#define GPIO_OSPEEDER_OSPEEDR10_1           GPIO_OSPEEDR_OSPEED10_1
#define GPIO_OSPEEDER_OSPEEDR11             GPIO_OSPEEDR_OSPEED11
#define GPIO_OSPEEDER_OSPEEDR11_0           GPIO_OSPEEDR_OSPEED11_0
#define GPIO_OSPEEDER_OSPEEDR11_1           GPIO_OSPEEDR_OSPEED11_1
#define GPIO_OSPEEDER_OSPEEDR12             GPIO_OSPEEDR_OSPEED12
#define GPIO_OSPEEDER_OSPEEDR12_0           GPIO_OSPEEDR_OSPEED12_0
#define GPIO_OSPEEDER_OSPEEDR12_1           GPIO_OSPEEDR_OSPEED12_1
#define GPIO_OSPEEDER_OSPEEDR13             GPIO_OSPEEDR_OSPEED13
#define GPIO_OSPEEDER_OSPEEDR13_0           GPIO_OSPEEDR_OSPEED13_0
#define GPIO_OSPEEDER_OSPEEDR13_1           GPIO_OSPEEDR_OSPEED13_1
#define GPIO_OSPEEDER_OSPEEDR14             GPIO_OSPEEDR_OSPEED14
#define GPIO_OSPEEDER_OSPEEDR14_0           GPIO_OSPEEDR_OSPEED14_0
#define GPIO_OSPEEDER_OSPEEDR14_1           GPIO_OSPEEDR_OSPEED14_1
#define GPIO_OSPEEDER_OSPEEDR15             GPIO_OSPEEDR_OSPEED15
#define GPIO_OSPEEDER_OSPEEDR15_0           GPIO_OSPEEDR_OSPEED15_0
#define GPIO_OSPEEDER_OSPEEDR15_1           GPIO_OSPEEDR_OSPEED15_1

