MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F217ZG/mcu.h
/****************** Bit definition for GPIO_AFRL register *********************/
#define GPIO_AFRL_AFSEL0                    0x0000000FU
#define GPIO_AFRL_AFSEL0_0                  0x00000001U
#define GPIO_AFRL_AFSEL0_1                  0x00000002U
#define GPIO_AFRL_AFSEL0_2                  0x00000004U
#define GPIO_AFRL_AFSEL0_3                  0x00000008U
#define GPIO_AFRL_AFSEL1                    0x000000F0U
#define GPIO_AFRL_AFSEL1_0                  0x00000010U
#define GPIO_AFRL_AFSEL1_1                  0x00000020U
#define GPIO_AFRL_AFSEL1_2                  0x00000040U
#define GPIO_AFRL_AFSEL1_3                  0x00000080U
#define GPIO_AFRL_AFSEL2                    0x00000F00U
#define GPIO_AFRL_AFSEL2_0                  0x00000100U
#define GPIO_AFRL_AFSEL2_1                  0x00000200U
#define GPIO_AFRL_AFSEL2_2                  0x00000400U
#define GPIO_AFRL_AFSEL2_3                  0x00000800U
#define GPIO_AFRL_AFSEL3                    0x0000F000U
#define GPIO_AFRL_AFSEL3_0                  0x00001000U
#define GPIO_AFRL_AFSEL3_1                  0x00002000U
#define GPIO_AFRL_AFSEL3_2                  0x00004000U
#define GPIO_AFRL_AFSEL3_3                  0x00008000U
#define GPIO_AFRL_AFSEL4                    0x000F0000U
#define GPIO_AFRL_AFSEL4_0                  0x00010000U
#define GPIO_AFRL_AFSEL4_1                  0x00020000U
#define GPIO_AFRL_AFSEL4_2                  0x00040000U
#define GPIO_AFRL_AFSEL4_3                  0x00080000U
#define GPIO_AFRL_AFSEL5                    0x00F00000U
#define GPIO_AFRL_AFSEL5_0                  0x00100000U
#define GPIO_AFRL_AFSEL5_1                  0x00200000U
#define GPIO_AFRL_AFSEL5_2                  0x00400000U
#define GPIO_AFRL_AFSEL5_3                  0x00800000U
#define GPIO_AFRL_AFSEL6                    0x0F000000U
#define GPIO_AFRL_AFSEL6_0                  0x01000000U
#define GPIO_AFRL_AFSEL6_1                  0x02000000U
#define GPIO_AFRL_AFSEL6_2                  0x04000000U
#define GPIO_AFRL_AFSEL6_3                  0x08000000U
#define GPIO_AFRL_AFSEL7                    0xF0000000U
#define GPIO_AFRL_AFSEL7_0                  0x10000000U
#define GPIO_AFRL_AFSEL7_1                  0x20000000U
#define GPIO_AFRL_AFSEL7_2                  0x40000000U
#define GPIO_AFRL_AFSEL7_3                  0x80000000U

/* Legacy defines */
#define GPIO_AFRL_AFRL0                      GPIO_AFRL_AFSEL0
#define GPIO_AFRL_AFRL0_0                    GPIO_AFRL_AFSEL0_0
#define GPIO_AFRL_AFRL0_1                    GPIO_AFRL_AFSEL0_1
#define GPIO_AFRL_AFRL0_2                    GPIO_AFRL_AFSEL0_2
#define GPIO_AFRL_AFRL0_3                    GPIO_AFRL_AFSEL0_3
#define GPIO_AFRL_AFRL1                      GPIO_AFRL_AFSEL1
#define GPIO_AFRL_AFRL1_0                    GPIO_AFRL_AFSEL1_0
#define GPIO_AFRL_AFRL1_1                    GPIO_AFRL_AFSEL1_1
#define GPIO_AFRL_AFRL1_2                    GPIO_AFRL_AFSEL1_2
#define GPIO_AFRL_AFRL1_3                    GPIO_AFRL_AFSEL1_3
#define GPIO_AFRL_AFRL2                      GPIO_AFRL_AFSEL2
#define GPIO_AFRL_AFRL2_0                    GPIO_AFRL_AFSEL2_0
#define GPIO_AFRL_AFRL2_1                    GPIO_AFRL_AFSEL2_1
#define GPIO_AFRL_AFRL2_2                    GPIO_AFRL_AFSEL2_2
#define GPIO_AFRL_AFRL2_3                    GPIO_AFRL_AFSEL2_3
#define GPIO_AFRL_AFRL3                      GPIO_AFRL_AFSEL3
#define GPIO_AFRL_AFRL3_0                    GPIO_AFRL_AFSEL3_0
#define GPIO_AFRL_AFRL3_1                    GPIO_AFRL_AFSEL3_1
#define GPIO_AFRL_AFRL3_2                    GPIO_AFRL_AFSEL3_2
#define GPIO_AFRL_AFRL3_3                    GPIO_AFRL_AFSEL3_3
#define GPIO_AFRL_AFRL4                      GPIO_AFRL_AFSEL4
#define GPIO_AFRL_AFRL4_0                    GPIO_AFRL_AFSEL4_0
#define GPIO_AFRL_AFRL4_1                    GPIO_AFRL_AFSEL4_1
#define GPIO_AFRL_AFRL4_2                    GPIO_AFRL_AFSEL4_2
#define GPIO_AFRL_AFRL4_3                    GPIO_AFRL_AFSEL4_3
#define GPIO_AFRL_AFRL5                      GPIO_AFRL_AFSEL5
#define GPIO_AFRL_AFRL5_0                    GPIO_AFRL_AFSEL5_0
#define GPIO_AFRL_AFRL5_1                    GPIO_AFRL_AFSEL5_1
#define GPIO_AFRL_AFRL5_2                    GPIO_AFRL_AFSEL5_2
#define GPIO_AFRL_AFRL5_3                    GPIO_AFRL_AFSEL5_3
#define GPIO_AFRL_AFRL6                      GPIO_AFRL_AFSEL6
#define GPIO_AFRL_AFRL6_0                    GPIO_AFRL_AFSEL6_0
#define GPIO_AFRL_AFRL6_1                    GPIO_AFRL_AFSEL6_1
#define GPIO_AFRL_AFRL6_2                    GPIO_AFRL_AFSEL6_2
#define GPIO_AFRL_AFRL6_3                    GPIO_AFRL_AFSEL6_3
#define GPIO_AFRL_AFRL7                      GPIO_AFRL_AFSEL7
#define GPIO_AFRL_AFRL7_0                    GPIO_AFRL_AFSEL7_0
#define GPIO_AFRL_AFRL7_1                    GPIO_AFRL_AFSEL7_1
#define GPIO_AFRL_AFRL7_2                    GPIO_AFRL_AFSEL7_2
#define GPIO_AFRL_AFRL7_3                    GPIO_AFRL_AFSEL7_3

/****************** Bit definition for GPIO_AFRH register *********************/
#define GPIO_AFRH_AFSEL8                    0x0000000FU
#define GPIO_AFRH_AFSEL8_0                  0x00000001U
#define GPIO_AFRH_AFSEL8_1                  0x00000002U
#define GPIO_AFRH_AFSEL8_2                  0x00000004U
#define GPIO_AFRH_AFSEL8_3                  0x00000008U
#define GPIO_AFRH_AFSEL9                    0x000000F0U
#define GPIO_AFRH_AFSEL9_0                  0x00000010U
#define GPIO_AFRH_AFSEL9_1                  0x00000020U
#define GPIO_AFRH_AFSEL9_2                  0x00000040U
#define GPIO_AFRH_AFSEL9_3                  0x00000080U
#define GPIO_AFRH_AFSEL10                   0x00000F00U
#define GPIO_AFRH_AFSEL10_0                 0x00000100U
#define GPIO_AFRH_AFSEL10_1                 0x00000200U
#define GPIO_AFRH_AFSEL10_2                 0x00000400U
#define GPIO_AFRH_AFSEL10_3                 0x00000800U
#define GPIO_AFRH_AFSEL11                   0x0000F000U
#define GPIO_AFRH_AFSEL11_0                 0x00001000U
#define GPIO_AFRH_AFSEL11_1                 0x00002000U
#define GPIO_AFRH_AFSEL11_2                 0x00004000U
#define GPIO_AFRH_AFSEL11_3                 0x00008000U
#define GPIO_AFRH_AFSEL12                   0x000F0000U
#define GPIO_AFRH_AFSEL12_0                 0x00010000U
#define GPIO_AFRH_AFSEL12_1                 0x00020000U
#define GPIO_AFRH_AFSEL12_2                 0x00040000U
#define GPIO_AFRH_AFSEL12_3                 0x00080000U
#define GPIO_AFRH_AFSEL13                   0x00F00000U
#define GPIO_AFRH_AFSEL13_0                 0x00100000U
#define GPIO_AFRH_AFSEL13_1                 0x00200000U
#define GPIO_AFRH_AFSEL13_2                 0x00400000U
#define GPIO_AFRH_AFSEL13_3                 0x00800000U
#define GPIO_AFRH_AFSEL14                   0x0F000000U
#define GPIO_AFRH_AFSEL14_0                 0x01000000U
#define GPIO_AFRH_AFSEL14_1                 0x02000000U
#define GPIO_AFRH_AFSEL14_2                 0x04000000U
#define GPIO_AFRH_AFSEL14_3                 0x08000000U
#define GPIO_AFRH_AFSEL15                   0xF0000000U
#define GPIO_AFRH_AFSEL15_0                 0x10000000U
#define GPIO_AFRH_AFSEL15_1                 0x20000000U
#define GPIO_AFRH_AFSEL15_2                 0x40000000U
#define GPIO_AFRH_AFSEL15_3                 0x80000000U

